Revit 2027 API
FailuresAccessor.GetAttemptedResolutionTypes Method
 Returns list of the failure resolution types attempted for the failure in the current transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureResolutionType> GetAttemptedResolutionTypes(
	FailureMessageAccessor failure
)
Public Function GetAttemptedResolutionTypes (
	failure As FailureMessageAccessor
) As IList(Of FailureResolutionType)
public:
IList<FailureResolutionType>^ GetAttemptedResolutionTypes(
	FailureMessageAccessor^ failure
)
member GetAttemptedResolutionTypes :
        failure : FailureMessageAccessor -> IList<FailureResolutionType>
Parameters
failure FailureMessageAccessor
 The failure.
Return Value
IList<FailureResolutionType>
 The list of the types of failure resolutions attempted for the failure.
Exceptions
Exception | Condition
ArgumentException |  failure has not been properly initialized.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 In some cases attempt to resolve a failure has no impact or failure gets reposted during next round of the end of transaction checks after being resolved. Knowing if any failure resolutions were attempted for the failure allows failures processor to prevent infinite loop.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace